# Casks
tap "homebrew/cask"

cask "google-chrome"
cask "firefox"

cask "discord"

cask "docker-edge"
cask "intellij-idea-ce"
cask "iterm2-nightly"
cask "macvim"
cask "sequel-pro"
cask "squirrelsql"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"

cask "font-fira-code"

cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "webpquicklook"

cask "spectacle"

cask "spotify"
cask "vlc"

cask "zsa-wally"

cask "zwift"

# Regular

# K8S
brew "helm"
brew "istioctl"
# Kubernetes TUI dash
brew "k9s"
# Kubernetes in docker locally
brew "kind"
# Argo rollout support for kubectl
brew "kubernetes-cli"
brew "kubernetes-helm"

# AWS
brew "aws-iam-authenticator"
brew "aws-shell"
brew "eksctl"

# Progamming languages
brew "ammonite-repl"
brew "gradle"
brew "maven"
brew "micronaut"
brew "mill"
brew "sbt"

# General Utils
## Count lines of code
brew "cloc"
# GNU version of shell utils
brew "coreutils"
# httpie interface with curl backend
brew "rs/tap/curlie"
# find alternative
brew "fd"
brew "fzf"
brew "gawk"
brew "git"
brew "git-extras"
brew "graphviz"
# Json grep, like jq sort of
brew "gron"
brew "homeshick"
brew "htop"
brew "httpie"
brew "hub"
brew "jq"
# load testing tool
brew "k6"
brew "mitmproxy"
# disk usage tui
brew "ncdu"
brew "neovim"
# Experimental shell to play with
brew "nushell"
brew "pandoc"
brew "parallel"
brew "pass"
brew "pinentry"
brew "pinentry-mac"
brew "pwgen"
# query csv with sql
brew "q"
brew "readline"
brew "reminders-cli"
brew "ripgrep"
brew "sqlite"
brew "the_silver_searcher"
brew "toxiproxy"
brew "trash"
brew "tree"
brew "wget"
brew "yq"
brew "zsh"

tap "amar1729/formulae"
brew "browserpass"
